{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Biology",
    "1": "Chemistry",
    "2": "Computer Science",
    "3": "Engineering",
    "4": "English",
    "5": "Mathematics",
    "6": "Physics"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Biology": 0,
    "Chemistry": 1,
    "Computer Science": 2,
    "Engineering": 3,
    "English": 4,
    "Mathematics": 5,
    "Physics": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
